#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
print('Цифра, обозначающая день недели: ')
day=int(input())
if day==1:
    print('no')
if day==2:
    print('no')
if day==3:
    print('no')
if day==4:
    print('no')
if day==5:
    print('no')
if day==6:
    print('yes')
if day==7:
    print('yes')
else:
    print('Такой цифры, обозначающей день недели нет')