# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
#  Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
from re import A


# a = [2, 3, 5, 9, 3]
# S = set(a)
# print(type(S))
# print(S)

# a = [i for i in range(25)]
# print(a)
# if a%2:
#     print('Четный элемент')
# else:
#     print(a!=0)

