#Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.



print('Введите число: ')
a = int(input())
print('Введите число: ')
b = int(input())
print('Введите число: ')
c = int(input())
print('Введите число: ')
d = int(input())
print('Введите число: ')
e = int(input())
max=a
if (max<b):
    max=b
if (max<c):
    max=c
if (max<d):
    max=d
if (max<e):
    max=e
print( max)
    
