#Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
print('Введите число: ')
a = int(input())
print('Введите число: ')
b = int(input())
if a==b**2:
    print('Yes')
else:
    print('No')


